In [1]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

In [3]:
df=pd.read_csv("Salary project")
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary
0        Prof          B             19           18  Male  139750
1        Prof          B             20           16  Male  173200
2    AsstProf          B              4            3  Male   79750
3        Prof          B             45           39  Male  115000
4        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [7]:
df["salary"]

0      139750
1      173200
2       79750
3      115000
4      141500
        ...
392    103106
393    150564
394    101738
395     95329
396     81035
Name: salary, Length: 397, dtype: int64

In [8]:
data=[['Prof',139750],['asstProf',79750],['Prof',173200]]
df=pd.DataFrame(data,columns=['rank','salary'],dtype=float)
print(df)

       rank    salary
0      Prof  139750.0
1  asstProf   79750.0
2      Prof  173200.0

C:\Users\dell\AppData\Local\Temp\ipykernel_11372\4048334846.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(data,columns=['rank','salary'],dtype=float)

In [9]:
df.head()

       rank    salary
0      Prof  139750.0
1  asstProf   79750.0
2      Prof  173200.0